In [4]:
from sqlalchemy import create_engine
import pandas as pd

In [5]:
engine = create_engine("mysql+mysqlconnector://root:jys502943@localhost/new_schema")

In [6]:
db = engine.connect()

In [7]:
%load_ext sql

In [8]:
%sql mysql+mysqldb://root:jys502943@localhost/new_schema

# Problem 1

In [13]:
%sql SELECT count(*) FROM chicagocrimedata

 * mysql+mysqldb://root:***@localhost/new_schema
1 rows affected.

[(385,)]

# Problem 2

In [14]:
%sql SELECT COMMUNITY_AREA_NAME FROM chicagocensusdata WHERE PER_CAPITA_INCOME < 11000

 * mysql+mysqldb://root:***@localhost/new_schema
4 rows affected.

[('West Garfield Park',),
 ('South Lawndale',),
 ('Fuller Park',),
 ('Riverdale',)]

# Problem 3

In [15]:
%sql SELECT CASE_NUMBER, DESCRIPTION FROM chicagocrimedata WHERE DESCRIPTION LIKE '%MINOR%'

 * mysql+mysqldb://root:***@localhost/new_schema
2 rows affected.

[('HL266884', 'SELL/GIVE/DEL LIQUOR TO MINOR'),
 ('HK238408', 'ILLEGAL CONSUMPTION BY MINOR')]

# Problem 4

In [16]:
%sql SELECT PRIMARY_TYPE, DESCRIPTION FROM chicagocrimedata WHERE PRIMARY_TYPE LIKE '%KIDNAP%'

 * mysql+mysqldb://root:***@localhost/new_schema
1 rows affected.

[('KIDNAPPING', 'CHILD ABDUCTION/STRANGER')]

# Problem 5

In [17]:
%sql SELECT PRIMARY_TYPE,LOCATION_DESCRIPTION FROM chicagocrimedata WHERE LOCATION_DESCRIPTION LIKE '%SCHOOL%'

 * mysql+mysqldb://root:***@localhost/new_schema
6 rows affected.

[('CRIMINAL DAMAGE', 'SCHOOL, PUBLIC, GROUNDS'),
 ('NARCOTICS', 'SCHOOL, PUBLIC, GROUNDS'),
 ('NARCOTICS', 'SCHOOL, PUBLIC, BUILDING'),
 ('CRIMINAL TRESPASS', 'SCHOOL, PUBLIC, GROUNDS'),
 ('PUBLIC PEACE VIOLATION', 'SCHOOL, PRIVATE, BUILDING'),
 ('PUBLIC PEACE VIOLATION', 'SCHOOL, PUBLIC, BUILDING')]

# Problem 6

In [18]:
%sql SELECT AVG(SAFETY_SCORE) FROM chicagopublicschools

 * mysql+mysqldb://root:***@localhost/new_schema
1 rows affected.

[(Decimal('45.3935'),)]

# Problem 7

In [19]:
%%sql
SELECT COMMUNITY_AREA_NAME, PERCENT_HOUSEHOLDS_BELOW_POVERTY
FROM chicagocensusdata
ORDER BY PERCENT_HOUSEHOLDS_BELOW_POVERTY DESC
LIMIT 5

 * mysql+mysqldb://root:***@localhost/new_schema
5 rows affected.

[('Riverdale', 56.5),
 ('Fuller Park', 51.2),
 ('Englewood', 46.6),
 ('North Lawndale', 43.1),
 ('East Garfield Park', 42.4)]

# Problem 8

In [20]:
%%sql
SELECT  COMMUNITY_AREA_NUMBER, COUNT(COMMUNITY_AREA_NUMBER) as NUMBER_OF_CRIMES
FROM chicagocrimedata
GROUP BY COMMUNITY_AREA_NUMBER
ORDER BY NUMBER_OF_CRIMES DESC
LIMIT 1

 * mysql+mysqldb://root:***@localhost/new_schema
1 rows affected.

[(0, 29)]

# Problem 9

In [22]:
%%sql
SELECT COMMUNITY_AREA_NAME, HARDSHIP_INDEX
FROM chicagocensusdata
WHERE HARDSHIP_INDEX = (SELECT MAX(HARDSHIP_INDEX) FROM chicagocensusdata)

 * mysql+mysqldb://root:***@localhost/new_schema
1 rows affected.

[('Riverdale', 98)]

# Problem 10

In [23]:
%%sql
SELECT COMMUNITY_AREA_NAME
FROM chicagocencusdata
WHERE COMMUNITY_AREA_NUMBER = (SELECT COMMUNITY_AREA_NUMBER from chicagocrimedata WHERE c

 * mysql+mysqldb://root:***@localhost/new_schema
(MySQLdb._exceptions.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '' at line 2")
[SQL: SELECT COMMUNITY_AREA_NAME FROM chicagocencusdata
WHERE COMMUNITY_AREA_NUMBER = (SELECT COMMUNITY_AREA_NUMBER from chicagocrimedata WHERE c]
(Background on this error at: http://sqlalche.me/e/14/f405)